import { Message } from "discord.js";
import { Command, handlerLoadOptionsInterface } from "../../../handler";
const zalgo = require("to-zalgo");

module.exports = class extends Command {
	constructor({ prefix }: handlerLoadOptionsInterface) {
		super("zalgo", {
			categories: "text",
			info: "**z̵̭͕̖̹͙̦̠̋̑͂̂͜ͅa̴̤̖̲̣̗̗̖̠͍͉̞̳̣̥͌́ͅl̷̮̱̤̀́͐̕g̵̡̘̞̞̰͉̹̙̮̮̳̠͕̓̀̑̆ǫ̷̼̪̰̘̥̻̝̾͋́̂͆́̚͘ȋ̴̻͈͈̹͈̮͆̾͂͝f̶̛̘̮͉͎̏̈́̌̒ŷ̸̧̡̢̧̯̟̬͎̦̩̻͍͂̑͋̈́̌̈͛͒̐̏̈́̄͌̑** letter(s) using [to-zalgo](https://www.npmjs.com/package/to-zalgo)",
			usage: `\`${prefix}command/alias <text>\``,
			guildOnly: false,
		});
	}

	async run(message: Message, args: string[]) {
		if (!args[0])
			return message.channel.send({
				embed: {
					description: "P̷̢̡̭̮̝͔̰̰̥̖̺̹̂́̅̌͊̑͊̀͘͝l̶̛͉̞̤̞̳̞̗̺̺̖̫̻͔͂̏͌́͒̔̓̽͆̆͝ȩ̵̢̡̧̡̻̠̰̖͉̣̟̘͈̌̃̈́͂̋͑͠ͅả̴̰̯̦̖̣̮̠̤̺͎̪͗͛̀̆͜͜s̷̲̝̻͕̥̻̥͉͔̈̑͋̈́̋̊́ͅḛ̴̛̛̈̆̾̐̇̆̕̕ ̵̼̦͉̼͆͊̄̈́͊̅̎͂̇̾͑͜͠͝e̵̡̻̮̬̜̱̰̻̮͍̊̀̔̊̆̈̒̕ń̴̢̧̬̗̳̤͚̲̻̈́̉̏͐̈́̑̋̀̔̈́͛̆̂̚͜ţ̶̡̛͉̗̱͔̱̯̑̉͋͗̀͊̀͝ȩ̶̛̛͕̝̟̞̥̞͎̜̫̲̲͕̀̾̓̈́̀̚̕ŗ̴͍̲̭͔̮͖̪͖̜̭̗͍̐̿̋͝ͅ ̵̨̢̳͇̺̥͔̙̬̪͓̲͉̞͛͂̎̐̎͝͠ͅt̷̨̛̜̺̩̪̳̂̆̑͠ḩ̷̗̗̭̞̉͂͛̍̈̓̏̇̕ë̸̛̛͉̦̲̣́͗̅̀͆͠ ̶̢̧̛̬͚̭̱̻͋̎͐̕ţ̸̛̺̪͉͈̰͚̤̫̭͇̫̫̖̙́̒̉ë̸̡͇̠͉̭͂̈̋̔̋̽͘̕ͅx̷̧̝̰̦͔͕̬͕͉͖͌̉͆̆̀̄̉͆͂̔̚̚ͅt̴̡̛̫̜̯̞̼̰̲̙͕͚̲̫̂͂̈́̿̋͑̀̀͘̚͝ ̶̝̩̬̳͎̭̂̈́̽̄̀͝t̵̨̨̜̰͉̰̩̳͍̻͉̫͍̔̑̉̇͆̄̽̊̾͊͌͝ḩ̷̻͕͙͓͌̉̃̄̽̊̎̆̔̿͘͜a̷̧̙͎͈̦̍́͌̓͒t̵̨̩̱̳̞̭͓͎̯͖̼̂̈́̈́͋̑͛͑́̈͂̑͗̉͊͘ ̸̧̯̳͕̹̦͈͍̾̍͛͒̈͆̇ŷ̷̢̬̣̲̏͊̉͒͠o̴̥͒̒̈͆̊̄͘͝͝ư̶̮̫̗̥̗̔͆͐͛͗̾̒̌̋ ̵͔̰̣̩̘̿̓̓̀̉͂̕̚͝w̷̛̥͓̘̹͓̞͚͛̓͆̒̅̑͊̕͝ą̶̪̭̫͓̻̫̪̏̐̈́̓͒̌͛̿͋̐̚͠n̷̛̥̳̹̣̹͍̥̤̂͛̉̍͒̍̕͘͜͝t̵̡̝̳͚̝͉̑̐̽̕ ̶̛̪̭̖̞͙̰͕́̽̓̏̍̔̅͠ͅt̷͈̝̮̬̦̀̊̌͐̍ơ̶̢͔̮̤͈̪̗̘͈͇̱̣̋̎ ̵̻͌̅͑̕**z̸̛̜̎͊̎͛̌́̋̉͠ă̵̛͈̟͔̹̝̙̞̝̐͌̉̏̂̔̍̀̌͝l̷͇̟̯͎͙͍̟̥͓̦̦̱͖̘̆̋̈̓̚̕ͅg̴̢̧̹̤̰̻͖̰͛̕o̷̢̧̺̠̘̜̩̭̟͚͚͛̏̓͜͝͝i̶̢̩̮̜̠͑̑̆̃̊̈̍̀f̴̨̛̬̺͉̜̜͈̫̦̜̹̻͇͗̈̀̌̊͗̉̃͜y̶̨̲̱̲̩͚͙̪̳̯̺͕̰̌̍͆̄͌̋̐**",
				},
			});

		return message.channel.send(zalgo(args.join(" ")));
	}
};
